app/controllers/welcome_controller.rb

  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('6b94398e90a6adf2459ab26b4eeb012d3c67528e', '2010-10-12 11:36:08', 'e94aee6b6d1cbbbe0dc94a8396fb668ff7a4e150', NULL, '2010-10-12 11:36:08', NULL, 'hoge', 'hoge@hoge.com')